In [1]:
from sklearn.impute import SimpleImputer
import numpy as np
import pandas as pd

In [2]:
data = {'age': [25, np.nan, 29, 41, np.nan, 18]}
dataset = pd.DataFrame(data)

In [3]:
dataset.head()

    age
0  25.0
1   NaN
2  29.0
3  41.0
4   NaN

In [4]:
imputer = SimpleImputer(missing_values=np.nan, strategy='constant',fill_value=999)

In [5]:
imputer.fit(dataset)

SimpleImputer(fill_value=999, strategy='constant')

In [6]:
# Input Missing Values
dataset = imputer.transform(dataset)

In [7]:
dataset = pd.DataFrame(dataset)
dataset.head()

       0
0   25.0
1  999.0
2   29.0
3   41.0
4  999.0